ConnalM/LVGL_Simulator/src/DisplayModule/ESP32_8048S070_Lvgl_DisplayDriver.cpp
#include "ESP32_8048S070_Lvgl_DisplayDriver.h"
#include "../common/DebugUtils.h" // Correct relative path
#include "../DisplayModule/lvgl/screens/RaceScreen.h" // New race screen
#include "../DisplayModule/lvgl/screens/RaceReadyScreen.h" // Relative path
#include "../DisplayModule/lvgl/screens/PauseScreen.h" // Pause screen
#include "../DisplayModule/lvgl/screens/StopScreen.h" // Stop screen
#include "../common/Types.h"        // For RaceData, ErrorInfo etc.
#include "../DisplayModule/DisplayManager.h" // For DisplayManager
#include "../RaceDataStub.h" // For test mode

// Throttle debug prints to once every 5 seconds
static unsigned long lastDebugPrint = 0;
const unsigned long DEBUG_THROTTLE_MS = 5000;

// Helper macro for throttled debug prints
#define DEBUG_PRINT_METHOD() \
    do { \
        unsigned long now = millis(); \
        if (now - lastDebugPrint > DEBUG_THROTTLE_MS) { \
            Serial.printf("[ESP32_8048S070] %s\n", __FUNCTION__); \
            lastDebugPrint = now; \
        } \
    } while(0)

// Initialize static LVGL draw buffer descriptor (buffer itself is now dynamic)
static lv_disp_draw_buf_t _lvglDrawBuf;

ESP32_8048S070_Lvgl_DisplayDriver::ESP32_8048S070_Lvgl_DisplayDriver() : 
    _rgbPanel(nullptr), _gfx(nullptr), _psram_lvglBuffer1(nullptr), 
    ui_MainMenuScreen(nullptr), ui_RaceReadyScreen(nullptr),
    ui_ConfigScreen(nullptr), ui_RaceActiveScreen(nullptr),
    config_screen_(nullptr), ui_CountdownScreen(nullptr),
    race_ready_screen_(nullptr), _debugLabel(nullptr) {
    DEBUG_PRINT_METHOD();
}

ESP32_8048S070_Lvgl_DisplayDriver::~ESP32_8048S070_Lvgl_DisplayDriver() {
    DEBUG_PRINT_METHOD();
    // Clean up RaceReadyScreen
    if (race_ready_screen_) {
        delete race_ready_screen_;
        race_ready_screen_ = nullptr;
        DPRINTLN("Freed RaceReadyScreen instance.");
    }
    
    // Clean up ConfigScreen
    if (config_screen_) {
        delete config_screen_;
        config_screen_ = nullptr;
        DPRINTLN("Freed ConfigScreen instance.");
    }
    
    if (this->_psram_lvglBuffer1) {
        heap_caps_free(this->_psram_lvglBuffer1);
        this->_psram_lvglBuffer1 = nullptr;
        DPRINTLN("Freed LVGL PSRAM buffer.");
    }
    if (_gfx) {
        delete _gfx;
        _gfx = nullptr;
    }
    if (_rgbPanel) {
        delete _rgbPanel;
        _rgbPanel = nullptr;
    }
}

bool ESP32_8048S070_Lvgl_DisplayDriver::initialize() {
    DEBUG_PRINT_METHOD();
    DPRINTLN("\n===== ESP32_8048S070_Lvgl_DisplayDriver: Initialization Start =====");
    DPRINTF("Display dimensions: %dx%d\n", LCD_WIDTH, LCD_HEIGHT);
    DPRINTF("PCLK speed: %d Hz\n", PREFER_SPEED_HZ);
    DPRINTF("HSYNC: front=%d, pulse=%d, back=%d\n", HSYNC_FRONT_PORCH, HSYNC_PULSE_WIDTH, HSYNC_BACK_PORCH);
    DPRINTF("VSYNC: front=%d, pulse=%d, back=%d\n", VSYNC_FRONT_PORCH, VSYNC_PULSE_WIDTH, VSYNC_BACK_PORCH);
    DPRINTF("Pin Definitions - DE:%d, VSYNC:%d, HSYNC:%d, PCLK:%d, BL:%d\n", 
           LCD_DE_PIN, LCD_VSYNC_PIN, LCD_HSYNC_PIN, LCD_PCLK_PIN, LCD_BACKLIGHT_PIN);

    // 1. Initialize GFX Driver (Arduino_GFX)
    DPRINTLN("\n[1/5] Initializing Arduino_ESP32RGBPanel...");
    _rgbPanel = new Arduino_ESP32RGBPanel(
        LCD_DE_PIN, LCD_VSYNC_PIN, LCD_HSYNC_PIN, LCD_PCLK_PIN,
        LCD_R0_PIN, LCD_R1_PIN, LCD_R2_PIN, LCD_R3_PIN, LCD_R4_PIN,
        LCD_G0_PIN, LCD_G1_PIN, LCD_G2_PIN, LCD_G3_PIN, LCD_G4_PIN, LCD_G5_PIN,
        LCD_B0_PIN, LCD_B1_PIN, LCD_B2_PIN, LCD_B3_PIN, LCD_B4_PIN,
        HSYNC_POLARITY, HSYNC_FRONT_PORCH, HSYNC_PULSE_WIDTH, HSYNC_BACK_PORCH,
        VSYNC_POLARITY, VSYNC_FRONT_PORCH, VSYNC_PULSE_WIDTH, VSYNC_BACK_PORCH,
        PCLK_ACTIVE_NEG, PREFER_SPEED_HZ);

    if (!_rgbPanel) {
        DEBUG_ERROR("FAILED: Could not create Arduino_ESP32RGBPanel instance");
        return false;
    }
    DPRINTLN("  - Arduino_ESP32RGBPanel instance created");

    // Create Arduino_RGB_Display with rotation 0 and auto_flush=true
    DPRINTLN("\n[2/5] Creating Arduino_RGB_Display...");
    _gfx = new Arduino_RGB_Display(LCD_WIDTH, LCD_HEIGHT, _rgbPanel, 0 /*rotation*/, true /*auto_flush*/);
    if (!_gfx) {
        DEBUG_ERROR("FAILED: Could not create Arduino_RGB_Display instance");
        delete _rgbPanel; _rgbPanel = nullptr;
        return false;
    }
    DPRINTLN("  - Arduino_RGB_Display instance created");

    DPRINTF("  - Calling _gfx->begin(%d)...\n", PREFER_SPEED_HZ);
    if (!_gfx->begin(PREFER_SPEED_HZ)) {
        DEBUG_ERROR("FAILED: _gfx->begin() returned false");
        delete _gfx; _gfx = nullptr;
        delete _rgbPanel; _rgbPanel = nullptr;
        return false;
    }
    DPRINTLN("  - _gfx->begin() successful");
    // _gfx->fillScreen(BLACK); // Optional: Clear screen initially with GFX

    // Manual backlight control
#ifdef LCD_BACKLIGHT_PIN
    DPRINTLN("\n[3/5] Initializing backlight...");
    pinMode(LCD_BACKLIGHT_PIN, OUTPUT);
    digitalWrite(LCD_BACKLIGHT_PIN, HIGH);
    DPRINTF("  - Backlight turned ON (pin %d)\n", LCD_BACKLIGHT_PIN);
#else
    DPRINTLN("\n[3/5] WARNING: No backlight pin defined (LCD_BACKLIGHT_PIN)");
#endif

    // 2. Initialize LVGL
    DPRINTLN("\n[4/5] Initializing LVGL...");
    lv_init();
    DPRINTF("  - LVGL initialized (v%d.%d.%d)\n", lv_version_major(), lv_version_minor(), lv_version_patch());

    // Calculate and log memory requirements
    DPRINTLN("\n[5/5] Setting up display buffers...");
    size_t total_pixels = LCD_WIDTH * LCD_HEIGHT;
    size_t buffer_pixel_count = total_pixels / 4; // Number of pixels
    size_t buffer_size_bytes = buffer_pixel_count * sizeof(lv_color_t);
    
    DPRINTF("  - Display resolution: %ux%u = %u pixels\n", LCD_WIDTH, LCD_HEIGHT, total_pixels);
    DPRINTF("  - LVGL buffer size: %u pixels (%.1f%% of total)\n", buffer_pixel_count, (float)buffer_pixel_count/total_pixels*100);
    DPRINTF("  - Buffer memory required: %u bytes\n", buffer_size_bytes);
    DPRINTF("  - LV_COLOR_DEPTH: %d bits\n", LV_COLOR_DEPTH);
    DPRINTF("  - sizeof(lv_color_t): %u bytes\n", sizeof(lv_color_t));
    DPRINTF("  - Attempting to allocate PSRAM buffer...");
    
    // Check available PSRAM before allocation
    size_t free_psram = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
    DPRINTF("Available PSRAM: %u bytes\n", free_psram);
    
    // Allocate primary buffer in PSRAM
    this->_psram_lvglBuffer1 = (lv_color_t*)heap_caps_malloc(buffer_size_bytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    bool using_psram = (this->_psram_lvglBuffer1 != nullptr);

    // Fallback to internal RAM if PSRAM allocation fails
    if (!using_psram) {
        DPRINTLN("  - PSRAM allocation failed!");
        DPRINTLN("  - Attempting to allocate smaller buffer in internal RAM...");
        
        // Try with a smaller buffer (1/10th of screen)
        buffer_pixel_count = (LCD_WIDTH * LCD_HEIGHT) / 10;
        buffer_size_bytes = buffer_pixel_count * sizeof(lv_color_t);
        this->_psram_lvglBuffer1 = (lv_color_t*)heap_caps_malloc(buffer_size_bytes, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        
        if (!this->_psram_lvglBuffer1) {
            DEBUG_ERROR("FATAL: Failed to allocate any display buffers!");
            if (_gfx) { delete _gfx; _gfx = nullptr; }
            if (_rgbPanel) { delete _rgbPanel; _rgbPanel = nullptr; }
            return false;
        }
        DPRINTF("  - WARNING: Using smaller buffer in internal RAM: %u pixels (%u bytes)\n", 
               buffer_pixel_count, buffer_size_bytes);
    } else {
        DPRINTF("  - Successfully allocated buffer in %s: %u pixels (%u bytes)\n",
               using_psram ? "PSRAM" : "internal RAM", 
               buffer_pixel_count, buffer_size_bytes);
    }

    // Initialize LVGL draw buffer
    DPRINTLN("\nInitializing LVGL draw buffer and display driver...");
    lv_disp_draw_buf_init(&_lvglDrawBuf, this->_psram_lvglBuffer1, nullptr, buffer_pixel_count);
    DPRINTF("  - LVGL draw buffer initialized with %u pixels\n", buffer_pixel_count);

    // Initialize LVGL display driver
    lv_disp_drv_init(&this->_lvglDisplayDriver);
    this->_lvglDisplayDriver.hor_res = LCD_WIDTH;
    this->_lvglDisplayDriver.ver_res = LCD_HEIGHT;
    this->_lvglDisplayDriver.flush_cb = ESP32_8048S070_Lvgl_DisplayDriver::lvgl_display_flush_cb;
    this->_lvglDisplayDriver.user_data = this;
    this->_lvglDisplayDriver.draw_buf = &_lvglDrawBuf;
    
    DPRINTLN("  - Registering LVGL display driver...");
    lv_disp_t* disp = lv_disp_drv_register(&this->_lvglDisplayDriver);
    if (!disp) {
        DEBUG_ERROR("FAILED: lv_disp_drv_register() returned NULL");
        return false;
    }
    DPRINTF("  - LVGL display driver registered successfully (handle: %p)\n", disp);

    // Note: Touch input driver (GT911_TouchInput) should be initialized separately
    // and will register its own LVGL input device.
    DPRINTLN("\nCreating LVGL screens...");
    
