ConnalM/LVGL_Simulator/src/DisplayModule/ESP32_8048S070_Lvgl_DisplayDriver.cpp
    // 3. Create LVGL Screens
    createMainMenuScreen();
    DPRINTLN("  - Created Main Menu screen");
    
    createRaceReadyScreen();
    DPRINTLN("  - Created Race Ready screen");
    
    createRaceActiveScreen();
    DPRINTLN("  - Created Race Active screen");
    
    createConfigScreen();
    DPRINTLN("  - Created Config Menu screen");
    
    createCountdownScreen();
    DPRINTLN("  - Created Countdown screen");

    // Don't load any screen by default - this should be done by DisplayManager or SystemController
    // This respects proper separation of concerns and module boundaries
    DPRINTLN("\nInitialization complete - screens created but none loaded by default");
    DPRINTLN("The caller (DisplayManager/SystemController) will decide which screen to show");
    
    // TODO: In normal operation (non-test mode), main.cpp should explicitly call displayManager.showMain()
    // after initialization to show the main menu as the default screen. This ensures proper architectural
    // boundaries are maintained while still providing the expected default behavior.

    DPRINTLN("\n===== ESP32_8048S070_Lvgl_DisplayDriver: Initialization SUCCESSFUL =====");
    return true;
}

void ESP32_8048S070_Lvgl_DisplayDriver::update() {
    DEBUG_PRINT_METHOD();
    static uint32_t lastUpdate = 0;
    const uint32_t updateInterval = 16;  // ~60fps (16.67ms)
    
    uint32_t now = millis();
    if (now - lastUpdate >= updateInterval) {
        lv_timer_handler();
        lastUpdate = now;
    }
    
    // Small delay to prevent 100% CPU usage
    vTaskDelay(1);
    
    // If we're using LV_TICK_CUSTOM=1, ensure TimeManager is updating LVGL ticks
    // This is handled by SystemController calling TimeManager::update()
}

void ESP32_8048S070_Lvgl_DisplayDriver::clear() {
    DEBUG_PRINT_METHOD();
    // Temporarily making this a no-op to prevent crashes
    // We'll implement proper screen clearing after stabilizing the display transitions
    DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::clear() called - no-op for now");
    
    // Note: We're not calling any LVGL functions here to prevent crashes
    // The display will be refreshed when the new screen is loaded
}

// Basic print/printf - might draw to a dedicated debug label on screen
void ESP32_8048S070_Lvgl_DisplayDriver::print(const String& message, bool newLine) {
    DEBUG_PRINT_METHOD();
    if (!_debugLabel) {
        // Create a debug label on the current screen if it doesn't exist
        // This is a basic implementation. A better one might use a scrolling log area.
        lv_obj_t* act_scr = lv_disp_get_scr_act(NULL);
        if (act_scr) {
            _debugLabel = lv_label_create(act_scr);
            lv_obj_align(_debugLabel, LV_ALIGN_BOTTOM_LEFT, 5, -5);
            lv_label_set_long_mode(_debugLabel, LV_LABEL_LONG_WRAP);
            lv_obj_set_width(_debugLabel, LCD_WIDTH - 10);
        }
    }
    if (_debugLabel) {
        String currentText = lv_label_get_text(_debugLabel);
        if (newLine) currentText += "\n";
        currentText += message;
        // Limit text length to avoid excessive memory use by label
        if (currentText.length() > 512) { 
            currentText = currentText.substring(currentText.length() - 512);
        }
        lv_label_set_text(_debugLabel, currentText.c_str());
    }
}

void ESP32_8048S070_Lvgl_DisplayDriver::printf(const char* format, ...) {
    DEBUG_PRINT_METHOD();
    char buffer[256];
    va_list args;
    va_start(args, format);
    vsnprintf(buffer, sizeof(buffer), format, args);
    va_end(args);
    print(String(buffer), false); // Assume printf doesn't auto-newline unless specified in format
}

// --- IGraphicalDisplay Implementations ---
void ESP32_8048S070_Lvgl_DisplayDriver::setCursor(int x, int y) {
    DEBUG_PRINT_METHOD(); 
    // Store cursor position for future text operations if needed
    DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::setCursor called");
    // No direct cursor in LVGL, but we can store position for future use
}

void ESP32_8048S070_Lvgl_DisplayDriver::setTextColor(uint32_t color) {
    DEBUG_PRINT_METHOD(); 
    // Store text color for future text operations
    DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::setTextColor called");
    // Could be used to set default text color for future text objects
}

void ESP32_8048S070_Lvgl_DisplayDriver::setTextSize(uint8_t size) {
    DEBUG_PRINT_METHOD(); 
    // Store text size for future text operations
    DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::setTextSize called");
    // Could be used to set default text size for future text objects
}

void ESP32_8048S070_Lvgl_DisplayDriver::drawRect(int x, int y, int w, int h, uint32_t color) {
    DEBUG_PRINT_METHOD();
    // Implementation for LVGL
    DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::drawRect called");
    
    // Convert 32-bit color to LVGL color format
    lv_color_t lvgl_color = lv_color_make((color >> 16) & 0xFF, (color >> 8) & 0xFF, color & 0xFF);
    
    // Use a static object for drawing rectangles to avoid memory leaks
    // This approach reuses the same object for all rectangles
    static lv_obj_t* rect = nullptr;
    
    // Create the rectangle object if it doesn't exist yet
    if (rect == nullptr) {
        rect = lv_obj_create(lv_scr_act());
    }
    
    // Update the rectangle properties
    lv_obj_set_pos(rect, x, y);
    lv_obj_set_size(rect, w, h);
    
    // Set style for outlined rectangle
    lv_obj_set_style_bg_opa(rect, LV_OPA_TRANSP, 0); // Transparent background
    lv_obj_set_style_border_color(rect, lvgl_color, 0);
    lv_obj_set_style_border_width(rect, 1, 0);
    
    // Make sure the rectangle is visible
    lv_obj_clear_flag(rect, LV_OBJ_FLAG_HIDDEN);
    
    // Note: This approach has limitations as it only shows one rectangle at a time
    // For multiple persistent rectangles, a more sophisticated approach would be needed
}

void ESP32_8048S070_Lvgl_DisplayDriver::fillRect(int x, int y, int w, int h, uint32_t color) {
    DEBUG_PRINT_METHOD();
    // Implementation for LVGL
    DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::fillRect called");
    
