ConnalM/LVGL_Simulator/src/DisplayModule/ESP32_8048S070_Lvgl_DisplayDriver.cpp
    // Convert 32-bit color to LVGL color format
    lv_color_t lvgl_color = lv_color_make((color >> 16) & 0xFF, (color >> 8) & 0xFF, color & 0xFF);
    
    // Use a static object for drawing filled rectangles to avoid memory leaks
    static lv_obj_t* rect = nullptr;
    
    // Create the rectangle object if it doesn't exist yet
    if (rect == nullptr) {
        rect = lv_obj_create(lv_scr_act());
    }
    
    // Update the rectangle properties
    lv_obj_set_pos(rect, x, y);
    lv_obj_set_size(rect, w, h);
    
    // Set style for filled rectangle
    lv_obj_set_style_bg_color(rect, lvgl_color, 0);
    lv_obj_set_style_border_width(rect, 0, 0); // No border
    
    // Make sure the rectangle is visible
    lv_obj_clear_flag(rect, LV_OBJ_FLAG_HIDDEN);
    
    // Note: This approach has limitations as it only shows one filled rectangle at a time
}

void ESP32_8048S070_Lvgl_DisplayDriver::drawCircle(int x, int y, int r, uint32_t color) {
    DEBUG_PRINT_METHOD();
    // Implementation for LVGL
    DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::drawCircle called");
    
    // Convert 32-bit color to LVGL color format
    lv_color_t lvgl_color = lv_color_make((color >> 16) & 0xFF, (color >> 8) & 0xFF, color & 0xFF);
    
    // Use a static object for drawing circles to avoid memory leaks
    static lv_obj_t* circle = nullptr;
    
    // Create the circle object if it doesn't exist yet
    if (circle == nullptr) {
        circle = lv_obj_create(lv_scr_act());
    }
    
    // Update the circle properties
    lv_obj_set_pos(circle, x - r, y - r); // Position adjusted to center
    lv_obj_set_size(circle, 2 * r, 2 * r);
    
    // Set style for outlined circle
    lv_obj_set_style_radius(circle, r, 0); // Make it circular
    lv_obj_set_style_bg_opa(circle, LV_OPA_TRANSP, 0); // Transparent background
    lv_obj_set_style_border_color(circle, lvgl_color, 0);
    lv_obj_set_style_border_width(circle, 1, 0);
    
    // Make sure the circle is visible
    lv_obj_clear_flag(circle, LV_OBJ_FLAG_HIDDEN);
    
    // Note: This approach has limitations as it only shows one circle at a time
}

void ESP32_8048S070_Lvgl_DisplayDriver::fillCircle(int x, int y, int r, uint32_t color) {
    DEBUG_PRINT_METHOD();
    // Implementation for LVGL
    DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::fillCircle called");
    
    // Convert 32-bit color to LVGL color format
    lv_color_t lvgl_color = lv_color_make((color >> 16) & 0xFF, (color >> 8) & 0xFF, color & 0xFF);
    
    // Use a static object for drawing filled circles to avoid memory leaks
    static lv_obj_t* circle = nullptr;
    
    // Create the circle object if it doesn't exist yet
    if (circle == nullptr) {
        circle = lv_obj_create(lv_scr_act());
    }
    
    // Update the circle properties
    lv_obj_set_pos(circle, x - r, y - r); // Position adjusted to center
    lv_obj_set_size(circle, 2 * r, 2 * r);
    
    // Set style for filled circle
    lv_obj_set_style_radius(circle, r, 0); // Make it circular
    lv_obj_set_style_bg_color(circle, lvgl_color, 0);
    lv_obj_set_style_border_width(circle, 0, 0); // No border
    
    // Make sure the circle is visible
    lv_obj_clear_flag(circle, LV_OBJ_FLAG_HIDDEN);
    
    // Note: This approach has limitations as it only shows one filled circle at a time
}

// --- Screen Drawing Methods --- 
void ESP32_8048S070_Lvgl_DisplayDriver::drawMain() {
    DEBUG_PRINT_METHOD();
    DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::drawMain");
    
    if (ui_MainMenuScreen) {
        DPRINTLN("Loading Main Menu screen...");
        lv_scr_load(ui_MainMenuScreen);
        
        // Force a full refresh of the display
        lv_refr_now(NULL);
        
        // Process any pending LVGL tasks
        lv_task_handler();
        
        DPRINTLN("Main Menu screen loaded and refreshed");
    } else {
        DPRINTLN("ERROR: Main Menu screen is null!");
    }
}

void ESP32_8048S070_Lvgl_DisplayDriver::updateRaceData(const std::vector<RaceLaneData>& laneData) {
    DEBUG_PRINT_METHOD();
    DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::updateRaceData - Updating race data display");
    
    // Debug: Print the lane data we received
    DPRINTF("Received %d lanes of race data:\n", laneData.size());
    for (const auto& lane : laneData) {
        if (lane.enabled) {
            DPRINTF("  Lane %d: Lap %d/%d, Last: %dms, Best: %dms, Total: %dms\n",
                  lane.laneId, lane.currentLap, lane.totalLaps,
                  lane.lastLapTime, lane.bestLapTime, lane.totalTime);
        }
    }
    
    // Check if we have a valid race screen reference
    if (_activeRaceScreen == nullptr) {
        DPRINTLN("_activeRaceScreen is null, trying to get it from UI...");
        
        // If _activeRaceScreen is not set, try to get it from the screen's user data
        if (ui_RaceActiveScreen != nullptr) {
            lv_obj_t* currentScreen = lv_scr_act();
            DPRINTF("Current screen: %p, RaceActiveScreen: %p\n", currentScreen, ui_RaceActiveScreen);
            
            if (currentScreen == ui_RaceActiveScreen) {
                _activeRaceScreen = static_cast<RaceScreen*>(lv_obj_get_user_data(ui_RaceActiveScreen));
                DPRINTF("Got _activeRaceScreen from UI: %p\n", _activeRaceScreen);
            } else {
                DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::updateRaceData - Not on race active screen");
                return;
            }
        } else {
            DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::updateRaceData - Race active screen not created");
            return;
        }
        
        // If we still don't have a valid reference, return
        if (_activeRaceScreen == nullptr) {
            DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::updateRaceData - No RaceScreen instance found");
            return;
        }
    } else {
        DPRINTF("Using existing _activeRaceScreen: %p\n", _activeRaceScreen);
    }
    
    // Get the active race mode UI from the race screen
    RaceModeUI* raceModeUI = _activeRaceScreen->GetActiveRaceModeUI();
    if (raceModeUI == nullptr) {
        DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::updateRaceData - No active race mode UI");
        return;
    }
    
