ConnalM/LVGL_Simulator/src/DisplayModule/ESP32_8048S070_Lvgl_DisplayDriver.cpp
    // Check the race mode and update the appropriate UI
    if (raceModeUI->GetMode() == RaceMode::LAPS || raceModeUI->GetMode() == RaceMode::TIMER) {
        // For both LAPS and TIMER modes, we can update the race data
        // as they both use the same update mechanism
        raceModeUI->UpdateRaceData(laneData);
        DPRINTF("ESP32_8048S070_Lvgl_DisplayDriver::updateRaceData - Updated %s UI\n", 
               raceModeUI->GetMode() == RaceMode::LAPS ? "LapsRaceUI" : "TimerRaceUI");
        
        // Debug output to verify data is being received
        for (size_t i = 0; i < laneData.size(); i++) {
            if (laneData[i].enabled) {
                DPRINTF("Lane %d: Pos %d, Lap %d/%d, Last: %d ms, Best: %d ms\n", 
                       laneData[i].laneId, 
                       laneData[i].position, 
                       laneData[i].currentLap, 
                       laneData[i].totalLaps, 
                       laneData[i].lastLapTime, 
                       laneData[i].bestLapTime);
            }
        }
    } else {
        DPRINTF("ESP32_8048S070_Lvgl_DisplayDriver::updateRaceData - Unsupported race mode: %d\n", 
               static_cast<int>(raceModeUI->GetMode()));
    }
}

void ESP32_8048S070_Lvgl_DisplayDriver::drawConfig() {
    DEBUG_PRINT_METHOD();
    static bool first_run = true;
    
    // Check if LVGL is initialized
    if (!lv_is_initialized()) {
        DPRINTLN("ERROR: LVGL not initialized, cannot show config screen");
        return;
    }
    
    DPRINTF("drawConfig - First run: %s\n", first_run ? "true" : "false");
    
    // Create the config screen if it doesn't exist
    if (!config_screen_) {
        DPRINTLN("Creating new ConfigScreen instance");
        config_screen_ = new (std::nothrow) ConfigScreen();
        if (!config_screen_) {
            DPRINTLN("ERROR: Failed to create ConfigScreen (memory allocation failed)");
            return;
        }
        DPRINTLN("ConfigScreen instance created");
    }
    
    // Store a reference to the config screen for future use
    ui_ConfigScreen = config_screen_->getScreen();
    if (!ui_ConfigScreen) {
        DPRINTLN("ERROR: Failed to get screen object from ConfigScreen");
        return;
    }
    
    DPRINTLN("Calling ConfigScreen::Show()");
    config_screen_->Show();
    
    // Force a full screen refresh on first run
    if (first_run) {
        DPRINTLN("First run - forcing screen refresh");
        lv_refr_now(nullptr);
        first_run = false;
    }
    
    DPRINTLN("drawConfig completed successfully");
}

// This method is now part of drawRaceReady and should not be used directly
// It's kept for backward compatibility but will be removed in future versions
void ESP32_8048S070_Lvgl_DisplayDriver::drawRaceScreenMenu() {
    DEBUG_PRINT_METHOD();
    // Deprecated: This method is kept for backward compatibility
    // Use drawRaceReady() instead
    DPRINTLN("WARNING: drawRaceScreenMenu is deprecated, use drawRaceReady instead");
    drawRaceReady();
}

void ESP32_8048S070_Lvgl_DisplayDriver::drawRaceReady() {
    DEBUG_PRINT_METHOD();
    DPRINTLN("Entering drawRaceReady()");
    
    // Ensure the RaceReadyScreen instance exists and is properly initialized
    if (!race_ready_screen_) {
        DPRINTLN("Creating new RaceReadyScreen instance");
        race_ready_screen_ = new RaceReadyScreen();
        if (race_ready_screen_) {
            DPRINTLN("RaceReadyScreen instance created successfully");
        } else {
            DPRINTLN("ERROR: Failed to create RaceReadyScreen instance");
            return;
        }
    } else {
        DPRINTLN("Using existing RaceReadyScreen instance");
    }
    
    // Show the RaceReady screen
    if (race_ready_screen_) {
        DPRINTLN("Showing RaceReady screen");
        
        // Call Show() which will handle the screen loading
        race_ready_screen_->Show();
        
        // Force an immediate update
        DPRINTLN("Forcing screen refresh");
        lv_refr_now(nullptr);
        
        DPRINTLN("Race ready screen shown and updated successfully");
    } else {
        DPRINTLN("ERROR: RaceReadyScreen instance is null");
    }
}

// Update the countdown display with the specified step
void ESP32_8048S070_Lvgl_DisplayDriver::updateCountdownDisplay(int currentStep) {
    DEBUG_PRINT_METHOD();
    if (!ui_CountdownScreen) {
        DPRINTLN("Countdown screen not created yet, creating now");
        createCountdownScreen();
    }
    
    // Update the countdown text
    lv_obj_t * countdown_label = lv_obj_get_child(ui_CountdownScreen, 0);
    if (countdown_label) {
        if (currentStep > 0) {
            lv_label_set_text_fmt(countdown_label, "%d", currentStep);
            lv_obj_set_style_text_color(countdown_label, lv_color_hex(0xFF0000), 0);
        } else {
            lv_label_set_text(countdown_label, "GO!");
            lv_obj_set_style_text_color(countdown_label, lv_color_hex(0x00FF00), 0);
        }
        lv_obj_center(countdown_label);
    }
    
    // Update the countdown display without changing screens
    // We don't load a new screen here as countdown is part of RaceReady
    
    DPRINTF("Countdown display updated with step: %d\n", currentStep);
}

// Draw the race active screen with the specified race mode
void ESP32_8048S070_Lvgl_DisplayDriver::drawRaceActive(RaceMode raceMode) {
    DEBUG_PRINT_METHOD();
    DPRINTF("ESP32_8048S070_Lvgl_DisplayDriver::drawRaceActive(raceMode: %d)\n", static_cast<int>(raceMode));
    
    // Create the race active screen if it doesn't exist
    if (!ui_RaceActiveScreen) {
        createRaceActiveScreen();
    }
    
    lv_scr_load(ui_RaceActiveScreen);
    
    static RaceScreen raceScreen(8); // Always create with 8 lanes initially
    static bool raceScreenInitialized = false;
    
    if (!raceScreenInitialized) {
        raceScreenInitialized = true;
        lv_obj_set_user_data(ui_RaceActiveScreen, &raceScreen);
    } else {
        // Update the number of lanes if needed
        raceScreen.SetNumLanes(8);
    }
    
    // Store a reference to the race screen for use in updateRaceData
    _activeRaceScreen = &raceScreen;
    
