ConnalM/LVGL_Simulator/src/DisplayModule/ESP32_8048S070_Lvgl_DisplayDriver.cpp
    // Store the previous race mode to detect changes
    // Currently unused - will be used for mode change detection in the future
    // static RaceMode previousRaceMode = RaceMode::LAPS; // Default to LAPS
    // previousRaceMode = raceMode;
    
    raceScreen.SetRaceMode(raceMode);
    
    raceScreen.Show();
    
    // In a proper architecture, we shouldn't be directly accessing RaceModule or RaceDataStub here
    // The DisplayManager should be passing race data to us through updateRaceData()
    // For testing purposes, we'll just set up the screen without any data
    // The main.cpp will call DisplayManager.updateRaceData() with the stub data
    
    DPRINTLN("Setting up RaceActive screen - waiting for data through updateRaceData()");
    
    // For testing purposes, we'll always assume we're in the Active state
    RaceState currentState = RaceState::Active;
    DPRINTF("Current race state: %d\n", static_cast<int>(currentState));
    
  
    // Initialize with empty race data - proper data will come through updateRaceData()
    std::vector<RaceLaneData> currentRaceData;
    DPRINTF("Initial race data size: %d\n", currentRaceData.size());
    
    // Log detailed lane data if available
    if (!currentRaceData.empty()) {
        DPRINTLN("Lane Data:");
        for (const auto& lane : currentRaceData) {
            DPRINTF("  Lane %d: %s, Laps: %d/%d, Enabled: %s, Finished: %s\n",
                  lane.laneId,
                  lane.racerName.c_str(),
                  lane.currentLap,
                  lane.totalLaps,
                  lane.enabled ? "true" : "false",
                  lane.finished ? "true" : "false");
        }
        
        // Always update UI with current data
        DPRINTF("Updating UI with %d lanes of race data\n", currentRaceData.size());
        raceScreen.GetActiveRaceModeUI()->UpdateRaceData(currentRaceData);
    } else {
        DPRINTLN("No race data available - initializing with empty data");
        // Initialize with empty data to show the UI structure
        std::vector<RaceLaneData> emptyRaceData;
        raceScreen.GetActiveRaceModeUI()->UpdateRaceData(emptyRaceData);
        
        // Commented out along with the race preparation code
        /*
        // If we just tried to prepare a race but still have no data, log an error
        if (needsRacePrep) {
            DPRINTLN("ERROR: Failed to prepare default race!");
        }
        */
    }
    
    raceScreen.Update();
}

// updateRaceData is already implemented elsewhere in the file

void ESP32_8048S070_Lvgl_DisplayDriver::startLightSequence() {
    DEBUG_PRINT_METHOD();
    DPRINTLN("ESP32_8048S070_Lvgl_DisplayDriver::startLightSequence()");
    
    // Make sure we're on the RaceReadyScreen
    if (lv_scr_act() != ui_RaceReadyScreen) {
        DPRINTLN("Warning: Not on RaceReadyScreen, switching to it first");
        drawRaceReady();
    }
    
    // Access the RaceReadyScreen instance and start the light sequence
    if (race_ready_screen_) {
        // Set up the callback to update the DisplayManager with countdown steps
        race_ready_screen_->SetCountdownStepCallback([](int step) {
            // Update the DisplayManager with the current countdown step
            DisplayManager::getInstance().showCountdown(step, step == 0);
            DPRINTLN("Countdown step: " + String(step));
        });
        
        race_ready_screen_->StartRedSequence();
        DPRINTLN("Light sequence started using stored instance");
    } else {
        DPRINTLN("ERROR: RaceReadyScreen instance is null");
        // Create it if it doesn't exist
        race_ready_screen_ = new RaceReadyScreen();
        
        // Set up the callback to update the DisplayManager with countdown steps
        race_ready_screen_->SetCountdownStepCallback([](int step) {
            // Update the DisplayManager with the current countdown step
            DisplayManager::getInstance().showCountdown(step, step == 0);
            DPRINTLN("Countdown step: " + String(step));
        });
        
        race_ready_screen_->StartRedSequence();
        DPRINTLN("Light sequence started with new instance");
    }
    
    DPRINTLN("Light sequence started");
}

void ESP32_8048S070_Lvgl_DisplayDriver::createConfigScreen() {
    DEBUG_PRINT_METHOD();
    DPRINTLN("Creating Config Screen...");
    
    // Create the ConfigScreen instance if it doesn't exist
    if (!config_screen_) {
        config_screen_ = new ConfigScreen();
        if (!config_screen_) {
            DEBUG_ERROR("FAILED: Could not create ConfigScreen instance");
            return;
        }
        DPRINTLN("  - ConfigScreen instance created successfully");
    } else {
        DPRINTLN("  - ConfigScreen instance already exists");
    }
    
    // Store the screen in the class member for later use
    ui_ConfigScreen = config_screen_->getScreen();
    if (!ui_ConfigScreen) {
        DEBUG_ERROR("FAILED: Could not get ConfigScreen LVGL screen");
        return;
    }
    
    DPRINTLN("  - Config Screen created successfully");
}

void ESP32_8048S070_Lvgl_DisplayDriver::event_cb_main_menu_config_button(lv_event_t * e) {
    DEBUG_PRINT_METHOD();
    DPRINTLN("Config Menu button clicked");
    InputEvent event;
    event.command = InputCommand::EnterConfig; // Existing command
    event.value = 0;
    event.sourceId = (int)InputSourceId::TOUCH;
    event.timestamp = TimeManager::GetInstance().GetCurrentTimeMs();
    event.target = getDefaultTargetForCommand(event.command);
    GT911_TouchInput::queueSystemInputEvent(event);
}

void ESP32_8048S070_Lvgl_DisplayDriver::event_cb_race_menu_start_button(lv_event_t* e) {
    DEBUG_PRINT_METHOD();
    DPRINTLN("Start Race button clicked from Race Menu");
    InputEvent event;
    event.command = InputCommand::StartCountdown;  // Changed from StartRace to StartCountdown
    event.value = 0;
    event.sourceId = (int)InputSourceId::TOUCH;
    event.timestamp = TimeManager::GetInstance().GetCurrentTimeMs();
    event.target = getDefaultTargetForCommand(event.command);
    GT911_TouchInput::queueSystemInputEvent(event);
}

void ESP32_8048S070_Lvgl_DisplayDriver::event_cb_race_menu_return_button(lv_event_t * e) {
    DEBUG_PRINT_METHOD();
    if (e->code != LV_EVENT_CLICKED) return;
    
    // Get the display driver instance
    ESP32_8048S070_Lvgl_DisplayDriver* driver = static_cast<ESP32_8048S070_Lvgl_DisplayDriver*>(lv_event_get_user_data(e));
    if (!driver) return;
    
