ConnalM/LVGL_Simulator/src/DisplayModule/ESP32_8048S070_Lvgl_DisplayDriver.cpp
    // Create InputEvent for returning to main menu
    InputEvent event;
    event.command = InputCommand::ChangeMode;
    event.value = 0; // Value for main menu
    event.sourceId = static_cast<int>(InputSourceId::TOUCH);
    event.timestamp = TimeManager::GetInstance().GetCurrentTimeMs();
    event.target = InputTarget::Race;
    
    // Queue the input event through the input manager
    GT911_TouchInput::queueSystemInputEvent(event);
}

void ESP32_8048S070_Lvgl_DisplayDriver::event_cb_main_menu_race_button(lv_event_t * e) {
    DEBUG_PRINT_METHOD();
    if (e->code != LV_EVENT_CLICKED) return;
    
    // Get the display driver instance
    ESP32_8048S070_Lvgl_DisplayDriver* driver = static_cast<ESP32_8048S070_Lvgl_DisplayDriver*>(lv_event_get_user_data(e));
    if (!driver) return;
    
    // Create InputEvent for race menu
    InputEvent event;
    event.command = InputCommand::EnterRaceReady;
    event.value = 0; // No specific value needed
    event.sourceId = static_cast<int>(InputSourceId::TOUCH);
    event.timestamp = TimeManager::GetInstance().GetCurrentTimeMs();
    event.target = InputTarget::Race;
    
    // Queue the input event through the input manager
    GT911_TouchInput::queueSystemInputEvent(event);
}

void ESP32_8048S070_Lvgl_DisplayDriver::lvgl_display_flush_cb(lv_disp_drv_t *disp_drv, const lv_area_t *area, lv_color_t *color_p) {
    DEBUG_PRINT_METHOD();
    ESP32_8048S070_Lvgl_DisplayDriver* driver = (ESP32_8048S070_Lvgl_DisplayDriver*)disp_drv->user_data;
    
    if (!driver || !driver->_gfx) {
        lv_disp_flush_ready(disp_drv);
        return;
    }
    
    uint32_t w = (area->x2 - area->x1 + 1);
    uint32_t h = (area->y2 - area->y1 + 1);
    
    // Start a new pixel data transfer
    driver->_gfx->startWrite();
    
    // Draw the pixels directly to the display using draw16bitBeRGBBitmap
    // This is the correct method for 16-bit color depth displays
    driver->_gfx->draw16bitBeRGBBitmap(area->x1, area->y1, (uint16_t*)color_p, w, h);
    
    // End the transfer
    driver->_gfx->endWrite();
    
    // Inform LVGL that flushing is done
    lv_disp_flush_ready(disp_drv);
}

// Create the main menu screen
void ESP32_8048S070_Lvgl_DisplayDriver::createMainMenuScreen() {
    DEBUG_PRINT_METHOD();
    if (ui_MainMenuScreen) {
        lv_obj_del(ui_MainMenuScreen);
        ui_MainMenuScreen = nullptr;
    }
    
    // Create the main menu screen with black background
    ui_MainMenuScreen = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(ui_MainMenuScreen, lv_color_black(), LV_PART_MAIN);
    lv_obj_set_style_border_width(ui_MainMenuScreen, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_all(ui_MainMenuScreen, 0, LV_PART_MAIN);
    
    // Add title
    lv_obj_t * title_label = lv_label_create(ui_MainMenuScreen);
    lv_label_set_text(title_label, "MAIN MENU");
    lv_obj_set_style_text_color(title_label, lv_color_white(), 0);
    lv_obj_set_style_text_font(title_label, &lv_font_montserrat_24, 0);
    lv_obj_align(title_label, LV_ALIGN_TOP_MID, 0, 20);
    
    // Style for buttons
    static lv_style_t btn_style;
    lv_style_init(&btn_style);
    lv_style_set_bg_color(&btn_style, lv_color_hex(0x333333));
    lv_style_set_radius(&btn_style, 10);
    lv_style_set_border_width(&btn_style, 0);
    
    // Add race button
    lv_obj_t * btn_race = lv_btn_create(ui_MainMenuScreen);
    lv_obj_add_style(btn_race, &btn_style, 0);
    lv_obj_set_size(btn_race, 200, 50);
    lv_obj_align(btn_race, LV_ALIGN_CENTER, 0, -50);
    lv_obj_add_event_cb(btn_race, event_cb_main_menu_race_button, LV_EVENT_CLICKED, this);
    
    lv_obj_t * btn_race_label = lv_label_create(btn_race);
    lv_label_set_text(btn_race_label, "Race");
    lv_obj_set_style_text_color(btn_race_label, lv_color_white(), 0);
    lv_obj_center(btn_race_label);
    
    // Add config button
    lv_obj_t * btn_config = lv_btn_create(ui_MainMenuScreen);
    lv_obj_add_style(btn_config, &btn_style, 0);
    lv_obj_set_size(btn_config, 200, 50);
    lv_obj_align(btn_config, LV_ALIGN_CENTER, 0, 30);
    lv_obj_add_event_cb(btn_config, event_cb_main_menu_config_button, LV_EVENT_CLICKED, this);
    
    lv_obj_t * btn_config_label = lv_label_create(btn_config);
    lv_label_set_text(btn_config_label, "Configuration");
    lv_obj_set_style_text_color(btn_config_label, lv_color_white(), 0);
    lv_obj_center(btn_config_label);
}

// Create the race ready screen
void ESP32_8048S070_Lvgl_DisplayDriver::createRaceReadyScreen() {
    DEBUG_PRINT_METHOD();
    
    // This method is now just a wrapper for drawRaceReady to maintain backward compatibility
    DPRINTLN("createRaceReadyScreen() called - delegating to drawRaceReady()");
    drawRaceReady();
}

// Create the race active screen
void ESP32_8048S070_Lvgl_DisplayDriver::createRaceActiveScreen() {
    DEBUG_PRINT_METHOD();
    if (ui_RaceActiveScreen) {
        lv_obj_del(ui_RaceActiveScreen);
        ui_RaceActiveScreen = nullptr;
    }
    
    // Create the race active screen as a simple black container
    // The RaceScreen class will add all necessary UI elements
    ui_RaceActiveScreen = lv_obj_create(NULL);
    lv_obj_set_size(ui_RaceActiveScreen, LV_HOR_RES, LV_VER_RES);
    lv_obj_set_style_bg_color(ui_RaceActiveScreen, lv_color_hex(0x000000), LV_PART_MAIN);
    lv_obj_set_style_pad_all(ui_RaceActiveScreen, 0, 0);
}

// Create the countdown screen
void ESP32_8048S070_Lvgl_DisplayDriver::createCountdownScreen() {
    DEBUG_PRINT_METHOD();
    if (ui_CountdownScreen) {
        lv_obj_del(ui_CountdownScreen);
        ui_CountdownScreen = nullptr;
    }
    
    // Create the countdown screen
    ui_CountdownScreen = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(ui_CountdownScreen, lv_color_hex(0x000000), LV_PART_MAIN);
    
    // Add countdown label
    lv_obj_t * countdown_label = lv_label_create(ui_CountdownScreen);
    lv_label_set_text(countdown_label, "3");
    lv_obj_set_style_text_color(countdown_label, lv_color_hex(0xFF0000), 0);
    lv_obj_set_style_text_font(countdown_label, &lv_font_montserrat_48, 0);
    lv_obj_center(countdown_label);
}

// Note: The createRaceActiveScreen method is already defined above

// Note: createRaceScreenMenu_common method has been removed as it's no longer needed in the new design

void ESP32_8048S070_Lvgl_DisplayDriver::drawStats() {
    DEBUG_PRINT_METHOD();
    
    // Create the stats screen if it doesn't exist
    if (!_statsScreen) {
        _statsScreen = new StatsScreen();
        if (!_statsScreen) {
            DPRINTLN("ERROR: Failed to create StatsScreen instance");
            return;
        }
        DPRINTLN("Created StatsScreen instance");
    }
    
    // Clear the display
    clear();
    
    // Show the stats screen
    _statsScreen->Show();
    
    // Force an immediate update
    lv_timer_handler();
    update();
    
    DPRINTLN("Stats screen shown");
}

void ESP32_8048S070_Lvgl_DisplayDriver::drawPause() {
    DEBUG_PRINT_METHOD();
    
    // Create the pause screen if it doesn't exist
    static PauseScreen* pauseScreen = nullptr;
    if (!pauseScreen) {
        pauseScreen = new PauseScreen();
        if (!pauseScreen) {
            DPRINTLN("ERROR: Failed to create PauseScreen instance");
            return;
        }
        DPRINTLN("Created PauseScreen instance");
    }
    
    // Clear the display
    clear();
    
    // Show the pause screen
    pauseScreen->Show();
    
    // Force an immediate update
    lv_timer_handler();
    update();
    
    DPRINTLN("Pause screen shown");
}

void ESP32_8048S070_Lvgl_DisplayDriver::drawStop() {
    DEBUG_PRINT_METHOD();
    
    // Create the stop screen if it doesn't exist
    static StopScreen* stopScreen = nullptr;
    if (!stopScreen) {
        stopScreen = new StopScreen();
        if (!stopScreen) {
            DPRINTLN("ERROR: Failed to create StopScreen instance");
            return;
        }
        DPRINTLN("Created StopScreen instance");
    }
    
    // Clear the display
    clear();
    
    // Show the stop screen
    stopScreen->Show();
    
    // Force an immediate update
    lv_timer_handler();
    update();
    
    DPRINTLN("Stop screen shown");
}
